import 'package:cinema_app/data/Film.dart';
import 'package:cinema_app/widgets/MAppBar.dart';
import 'package:cinema_app/widgets/MFilmCardList.dart';
import 'package:cinema_app/widgets/MMenuBar.dart';
import 'package:flutter/material.dart';

class HomeScreen extends StatelessWidget {
  final films = <Film>[
    Film(
        'assets/film_1.jpeg',
        'Тоска (пряма трансляція)',
        'Tosca',
        'Lorem Ipsum є, фактично, стандартною "рибою" аж з XVI сторіччя, коли невідомий друкар взяв шрифтову гранку та склав на ній підбірку зразків шрифтів. "Риба" не тільки успішно пережила пять століть, але й прижилася в електронному верстуванні, залишаючись по суті незмінною. Вона популяризувалась в 60-их роках минулого сторіччя завдяки виданню зразків шрифтів Letraset, які містили уривки з Lorem Ipsum, і вдруге - нещодавно завдяки програмам компютерного верстування на кшталт Aldus Pagemaker, які використовували різні версії Lorem Ipsum.',
        16,
        'Девід Маквікар',
        '11.04.2020',
        'Італійська мова з англійськими субтитрами',
        'Опера, Театр',
        '3:07',
        'США',
        'The Metropolitan Opera',
        'Анна Нетребко, Брайан Джагд, Міхаель Фолле, Патрік Карфіцці',
        '11.05.2020',
        15.1),
    Film(
        'assets/film_2.jpeg',
        'Секрет',
        'The Secret: Dare to Dream',
        'Lorem Ipsum є, фактично, стандартною "рибою" аж з XVI сторіччя, коли невідомий друкар взяв шрифтову гранку та склав на ній підбірку зразків шрифтів. "Риба" не тільки успішно пережила пять століть, але й прижилася в електронному верстуванні, залишаючись по суті незмінною. Вона популяризувалась в 60-их роках минулого сторіччя завдяки виданню зразків шрифтів Letraset, які містили уривки з Lorem Ipsum, і вдруге - нещодавно завдяки програмам компютерного верстування на кшталт Aldus Pagemaker, які використовували різні версії Lorem Ipsum.',
        16,
        'Енді Теннант',
        '16.04.2020',
        'Українська мова',
        'Драма',
        '1:38',
        'США',
        'Lionsgate, Roadside Attractions',
        'Kеті Голмс Джош Лукас Джеррі О’Коннелл Селія Вестон',
        '11.05.2020'),
    Film(
        'assets/film_3.jpeg',
        'Агент Лев',
        'Le lion',
        'Lorem Ipsum є, фактично, стандартною "рибою" аж з XVI сторіччя, коли невідомий друкар взяв шрифтову гранку та склав на ній підбірку зразків шрифтів. "Риба" не тільки успішно пережила пять століть, але й прижилася в електронному верстуванні, залишаючись по суті незмінною. Вона популяризувалась в 60-их роках минулого сторіччя завдяки виданню зразків шрифтів Letraset, які містили уривки з Lorem Ipsum, і вдруге - нещодавно завдяки програмам компютерного верстування на кшталт Aldus Pagemaker, які використовували різні версії Lorem Ipsum.',
        16,
        'Людовик Кольбо-Жюстен',
        '16.04.2020',
        'Українська мова',
        'Комедія',
        '1:35',
        'Франція, Бельгія',
        'Monkey Pack Films, TF1 Studio, Pathé',
        'Дені Бун, Філіп Катрін, Енні Серра, Софі Вербек, Кароль Брана',
        '11.05.2020'),
  ];

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: MAppBar(),
      body: MFilmCardList(films),
      drawer: MMenuBar(),
    );
  }
}
